In [1]:
#qp2
import pandas as pd
import numpy as np
import warnings
warnings.simplefilter('ignore')

In [2]:
#1
month=input('Enter the month name:\n')
if month=='February'or month=='february':
    print('28 or 29 days')
elif month in ('January','january','March','march','May','may','July','july','August','august','October','october','December','december'):
    print('31 days')
else:
    print('30 days')

Enter the month name:
march
31 days

In [3]:
#2
side1=int(input('Enter side 1\t'))
side2=int(input('Enter side 2\t'))
side3=int(input('Enter side 3\t'))
print('sides of the Triangle:',side1,side2,side3)
if side1==side2==side3:
    print('equilateral triangle')
elif side1==side2 or side1==side3:
    print('isosceles triangle')
else:
    print('scalene triangle')

Enter side 1	5
Enter side 2	6
Enter side 3	8
sides of the Triangle: 5 6 8
scalene triangle

In [4]:
#3
month=input('Enter month')
day=int(input('Enter date'))
if month=='march' or month=='March':
    if(day<20):
        print('Pisces (Fish)')
    else:
        print('Aries (Ram)')
elif month=='april'or month=='April':
    if(day<19):
        print('Aries (Ram)')
    else:
        print('Taurus (Bull)')
elif month=='may'or month=='May':
    if(day<20):
        print('Taurus (Bull)')
    else:
        print('Gemini (Twins)')
elif month=='june'or month=='June':
    if(day<21):
        print('Gemini (Twins)')
    else:
        print('Cancer (Crab)')
elif month=='july'or month=='July':
    if(day<22):
         print('Cancer (Crab)')
    else:
        print('Leo (Lion)')
elif month=='august'or month=='August':
    if(day<22):
        print('Leo (Lion)')
    else:
        print('Virgo (Virgin)')
elif month=='september'or month=='September':
    if(day<22):
        print('Virgo (Virgin)')
    else:
        print('Libra (Balance)')
elif month=='october'or month=='October':
    if(day<23):
         print('Libra (Balance)')
    else:
        print('Scorpius (Scorpion)')
elif month=='november'or month=='November':
    if(day<21):
        print('Scorpius (Scorpion)')  
    else:
        print('Sagittarius (Archer)')
elif month=='december'or month=='December':
    if(day<21):
        print('Sagittarius (Archer)')
    else:
        print('Capricornus (Goat)')
elif month=='january'or month=='January':
    if(day<19):
        print('Capricornus (Goat)')
    else:
        print('Aquarius (Water Bearer)')
elif month=='february'or month=='February':
    if(day<18):
        print('Aquarius (Water Bearer)')
    else:
        print('Pisces (Fish)')

Enter monthdecember
Enter date20
Sagittarius (Archer)

In [16]:
#4
student={'student_id':['S1','S2','S3','S4','S5'],'name':['Danniella Fenton','Ryder Storey','Bryce Jensen','Ed Bernal','Kwame Morin'],'marks':[200,210,190,222,199]}

In [6]:
student_data_1=pd.DataFrame(student,index=np.arange(0,5))

In [7]:
#4
student1={'student_id':['S4','S5','S6','S7','S8'],'name':['Scarlette Fisher','Carla Williamson','Dante Morse','Kaiser William','Madeeha Preston'],'marks': [201,200,198,219,201]}

In [8]:
student_data_2=pd.DataFrame(student1,index=np.arange(0,5))

In [9]:
student_data_1

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199

In [10]:
student_data_2

  student_id              name  marks
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

In [11]:
frames=[student_data_1,student_data_2]
result=pd.concat(frames)

In [12]:
result

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

In [13]:
stu={'student_id':'S6','name':'Scarlette Fisher','marks':205}

In [14]:
student_data_1=student_data_1.append(stu,ignore_index=True)

In [15]:
student_data_1

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
5         S6  Scarlette Fisher    205